[
    {
       "id": 1,
        "name": "Corely",
        "slug": "corely",
        "category": "MODERN E-COMMERCE PLATFORM",
        "desc": "Sleek e-commerce platform showcasing products with clean design, intuitive navigation, and a smooth shopping experience",
        "github": "https://github.com/danielekeberg/corely",
        "live": "https://corely.netlify.app/",
        "duration": "6 weeks",
        "tech": ["React", "TypeScript", "Tailwind CSS"],
        "img": "../corely-teaser.jpg",
        "description": "Corely was created as a modern e-commerce platform with an emphasis on simplicity, structure, and usability. The project aimed to deliver a seamless shopping experience where users can easily browse, evaluate, and purchase products without friction. Key challenges involved designing a scalable product listing system, implementing search and sorting functionality, and building a smooth shopping cart flow. The checkout experience was carefully structured to feel efficient and predictable. The visual design focuses on clarity and consistency, minimizing cognitive load while keeping the interface visually balanced. Each interaction was crafted to feel familiar, fast, and trustworthy."
    },
    {
        "id": 2,
        "name": "LuxeLot",
        "slug": "luxelot",
        "category": "ACTION MARKETPLACE PLATFORM",
        "desc": "Modern auction marketplace where users create listings, place real-time bids, and enjoy a clean, intuitive bidding experience.",
        "github": "https://github.com/danielekeberg/luxelot",
        "live": "https://luxelot.netlify.app/",
        "duration": "6 weeks",
        "tech": ["JavaScript", "HTML", "CSS"],
        "img": "../luxelot-teaser.jpg",
        "description": "LuxeLot was built to modernize the online auction experience by combining real-time interactions with a clean and approachable interface. The project focused on making bidding intuitive and engaging, while maintaining clarity and trust throughout the user journey. Key challenges included handling live bid updates, managing user authentication, and ensuring listings and bids felt instantly responsive. Special attention was given to feedback states, so users always understand the current auction status. The design prioritizes focus and hierarchy, reducing distractions while highlighting essential auction information. Every interaction was designed to feel deliberate, responsive, and rewarding for both buyers and sellers."
    },
    {
        "id": 3,
        "name": "DanBook",
        "slug": "danbook",
        "category": "SOCIAL BLOGGING PLATFORM",
        "desc": "Social blogging platform where users create posts, interact with others, and manage profiles in a modern dark-themed interface.",
        "github": "https://github.com/danielekeberg/danbook",
        "live": "https://danbook.netlify.app/",
        "duration": "6 weeks",
        "tech": ["JavaScript", "HTML", "CSS"],
        "img": "../danbook-teaser.jpg",
        "description": "DanBook was built as a social blogging platform focused on user-generated content and community interaction. The project aimed to create a clean and engaging environment where users can share posts, explore activity feeds, and interact with other users through a familiar social-style interface. Key challenges included implementing full CRUD functionality for posts, handling user authentication, and managing dynamic profile data such as followers, posts, and interactions. Particular attention was given to state management and ensuring updates felt immediate and responsive across the platform. The design emphasizes clarity and immersion through a dark, modern aesthetic with subtle gradients and visual hierarchy. Every interaction was carefully designed to feel smooth, intuitive, and consistent, creating a cohesive social experience from feed to profile."
    },
    {
        "id": 4,
        "name": "CSStatLab",
        "slug": "csstatlab",
        "category": "GAME PERFORMANCE ANALYTICS",
        "desc": "CSStatLab analyzes Counter-Strike match data to deliver advanced insights into player performance and aim skill.",
        "github": "https://github.com/danielekeberg/csstatlab",
        "live": "https://csstatlab.com/",
        "duration": "1 week",
        "tech": ["React", "TypeScript", "Tailwind CSS", "Supabase"],
        "img": "../csstatlab-teaser.jpg",
        "description": "CSStatLab is a Counter-Strike performance analysis platform focused on advanced player statistics and aim evaluation. It goes beyond traditional metrics like K/D to uncover deeper patterns in player behavior and mechanical skill. A custom Aim Rating system analyzes recent matches using benchmarked, weighted, and calibrated metrics. Interactive visualizations make it easy to compare performance trends across matches. The platform also provides FairPlay insights that highlight unusual statistical patterns without making accusations. CSStatLab is designed for learning, analysis, and meaningful skill comparison."
    },
    {
        "id": 5,
        "name": "Gym Center Demo",
        "slug": "gymcenter",
        "category": "FITNESS WEBSITE DEMO",
        "desc": "A clean demo showcasing a fitness center layout with basic info and features.",
        "github": "https://github.com/danielekeberg/treningssenter-demo",
        "live": "https://treningssenter-demo.vercel.app/",
        "duration": "6 weeks",
        "tech": ["React", "TypeScript", "Tailwind CSS"],
        "img": "../treningssenter-teaser.jpg",
        "description": "This Gym Center Demo is a conceptual website created to showcase how a modern fitness center can be presented online. The project focuses on a clean, professional layout with strong typography, clear structure, and a dark visual theme for a premium look and feel. It displays essential information such as services, facilities, and training offerings in a clear and user-friendly way. The site is built with performance and maintainability in mind, using React, TypeScript, and Tailwind CSS. This project is a demo and design concept rather than a full production website. Its purpose is to demonstrate UI/UX skills, component-based architecture, and modern frontend development practices."
    },
    {
        "id": 6,
        "name": "Hadeland Gravstein",
        "slug": "hadelandgravstein",
        "category": "MEMORIAL PRODUCTS WEBSITE",
        "desc": "A website for Hadeland Gravstein showcasing gravestone products, options, and transparent pricing.",
        "github": "https://github.com/danielekeberg/hg",
        "live": "https://hadelandgravstein.no/",
        "duration": "1 week",
        "tech": ["React", "TypeScript", "Tailwind CSS"],
        "img": "../hg-teaser.jpg",
        "description": "Hadeland Gravstein is a website designed to present gravestone products in a clear and respectful manner. The site allows users to browse different gravestone models, view pricing, and understand available customization options. Emphasis is placed on simplicity, clarity, and ease of navigation to ensure a calm and accessible user experience. The layout is structured to guide users through products without overwhelming information. This project focuses on clean UI, informative content, and practical product presentation. The website serves as a digital showroom for gravestone products and related services."
    },
    {
        "id": 7,
        "name": "Holidaze",
        "slug": "holidaze",
        "category": "TRAVEL BOOKING PLATFORM",
        "desc": "Holidaze is a booking platform that helps users discover unique stays through a clean and intuitive interface.",
        "github": "https://github.com/danielekeberg/holidaze",
        "live": "https://holidaze-iota.vercel.app/",
        "duration": "6 weeks",
        "tech": ["React", "TypeScript", "Tailwind CSS"],
        "img": "../holidaze-teaser.jpg",
        "description": "Holidaze was designed to help users discover and explore unique places to stay through an engaging and visually rich booking experience. The project focused on combining inspirational content with clear navigation and practical search functionality. Key challenges included presenting large amounts of property data in a digestible way and ensuring the platform remained responsive across devices. Emphasis was placed on guiding users smoothly from exploration to detailed property views. The design language balances atmosphere with usability, allowing visuals to inspire without overwhelming the interface. Every interaction was designed to feel calm, intuitive, and confidence-inspiring throughout the booking journey."
    },
    {
        "id": 8,
        "name": "TimeStampify",
        "slug": "timestampify",
        "category": "VISITOR TRACKING EXPERIMENT",
        "desc": "TimeStampify logs each page visit and displays timestamps in real time for fun and experimentation.",
        "github": "https://github.com/danielekeberg/timestampify",
        "live": "https://timestampify-six.vercel.app/",
        "duration": "1 day",
        "tech": ["React", "TypeScript", "Tailwind CSS", "Supabase"],
        "img": "../timestampify-teaser.jpg",
        "description": "TimeStampify is a simple experimental project that tracks when users visit a page and displays the timestamps directly on the screen. Each visit is logged sequentially, creating a live list of access times. The project was built as a lightweight, for-fun experiment focusing on simplicity and immediacy. There are no advanced analytics or user identification—only basic visit tracking. The minimal interface emphasizes the raw data without distractions. TimeStampify serves as a playful exploration of event logging, state updates, and real-time UI rendering."
    }
]