[
  {
    "id": 1,
    "name": "CSStatLab",
    "slug": "csstatlab",
    "category": "GAME PERFORMANCE ANALYTICS",
    "desc": "CSStatLab analyzes Counter-Strike match data to deliver advanced insights into player performance and aim skill.",
    "github": "https://github.com/danielekeberg/csstatlab",
    "live": "https://csstatlab.com/",
    "duration": "1 week",
    "tech": ["React", "TypeScript", "Tailwind CSS", "Supabase"],
    "img": "../csstatlab-teaser.jpg",
    "description": "CSStatLab is a Counter-Strike performance analysis platform focused on advanced player statistics and aim evaluation. It goes beyond traditional metrics like K/D to uncover deeper patterns in player behavior and mechanical skill. A custom Aim Rating system analyzes recent matches using benchmarked, weighted, and calibrated metrics. Interactive visualizations make it easy to compare performance trends across matches. The platform also provides FairPlay insights that highlight unusual statistical patterns without making accusations. CSStatLab is designed for learning, analysis, and meaningful skill comparison."
  },
  {
    "id": 2,
    "name": "Gym Center Demo",
    "slug": "gymcenter",
    "category": "FITNESS WEBSITE DEMO",
    "desc": "A clean demo showcasing a fitness center layout with basic info and features.",
    "github": "https://github.com/danielekeberg/treningssenter-demo",
    "live": "https://treningssenter-demo.vercel.app/",
    "duration": "1 day",
    "tech": ["React", "TypeScript", "Tailwind CSS"],
    "img": "../treningssenter-teaser.jpg",
    "description": "This Gym Center Demo is a conceptual website created to showcase how a modern fitness center can be presented online. The project focuses on a clean, professional layout with strong typography, clear structure, and a dark visual theme for a premium look and feel. It displays essential information such as services, facilities, and training offerings in a clear and user-friendly way. The site is built with performance and maintainability in mind, using React, TypeScript, and Tailwind CSS. This project is a demo and design concept rather than a full production website. Its purpose is to demonstrate UI/UX skills, component-based architecture, and modern frontend development practices."
  },
  {
    "id": 3,
    "name": "Hadeland Gravstein",
    "slug": "hadelandgravstein",
    "category": "MEMORIAL PRODUCTS WEBSITE",
    "desc": "A website for Hadeland Gravstein showcasing gravestone products, options, and transparent pricing.",
    "github": "https://github.com/danielekeberg/hg",
    "live": "https://hadelandgravstein.no/",
    "duration": "1 week",
    "tech": ["React", "TypeScript", "Tailwind CSS"],
    "img": "../hg-teaser.jpg",
    "description": "Hadeland Gravstein is a website designed to present gravestone products in a clear and respectful manner. The site allows users to browse different gravestone models, view pricing, and understand available customization options. Emphasis is placed on simplicity, clarity, and ease of navigation to ensure a calm and accessible user experience. The layout is structured to guide users through products without overwhelming information. This project focuses on clean UI, informative content, and practical product presentation. The website serves as a digital showroom for gravestone products and related services."
  },
  {
    "id": 4,
    "name": "Holidaze",
    "slug": "holidaze",
    "category": "TRAVEL BOOKING PLATFORM",
    "desc": "Holidaze is a booking platform that helps users discover unique stays through a clean and intuitive interface.",
    "github": "https://github.com/danielekeberg/holidaze",
    "live": "https://holidaze-iota.vercel.app/",
    "duration": "6 weeks",
    "tech": ["React", "TypeScript", "Tailwind CSS"],
    "img": "../holidaze-teaser.jpg",
    "description": "Holidaze was designed to help users discover and explore unique places to stay through an engaging and visually rich booking experience. The project focused on combining inspirational content with clear navigation and practical search functionality. Key challenges included presenting large amounts of property data in a digestible way and ensuring the platform remained responsive across devices. Emphasis was placed on guiding users smoothly from exploration to detailed property views. The design language balances atmosphere with usability, allowing visuals to inspire without overwhelming the interface. Every interaction was designed to feel calm, intuitive, and confidence-inspiring throughout the booking journey."
  }
]
