[
    {
       "id": 1,
        "name": "Corely",
        "slug": "corely",
        "category": "MODERN E-COMMERCE PLATFORM",
        "desc": "Corely is a sleek e-commerce platform designed to showcase products with a clean layout and easy navigation. It delivers a seamless shopping experience with product listings, detailed views, and a fully functional cart.",
        "github": "https://github.com/danielekeberg/corely",
        "live": "https://corely.netlify.app/",
        "duration": "6 weeks",
        "tech": ["React", "TypeScript", "Tailwind CSS"],
        "img": "../corely-teaser.jpg",
        "description": "Corely was created as a modern e-commerce platform with an emphasis on simplicity, structure, and usability. The project aimed to deliver a seamless shopping experience where users can easily browse, evaluate, and purchase products without friction. Key challenges involved designing a scalable product listing system, implementing search and sorting functionality, and building a smooth shopping cart flow. The checkout experience was carefully structured to feel efficient and predictable. The visual design focuses on clarity and consistency, minimizing cognitive load while keeping the interface visually balanced. Each interaction was crafted to feel familiar, fast, and trustworthy."
    },
    {
        "id": 2,
        "name": "LuxeLot",
        "slug": "luxelot",
        "category": "ACTION MARKETPLACE PLATFORM",
        "desc": "LuxeLot is a modern auction marketplace where users can create listings, place bids, and compete in real time. The platform focuses on clean UI, smooth interactions, and an intuitive bidding experience.",
        "github": "https://github.com/danielekeberg/luxelot",
        "live": "https://luxelot.netlify.app/",
        "duration": "6 weeks",
        "tech": ["JavaScript", "HTML", "CSS"],
        "img": "../luxelot-teaser.jpg",
        "description": "LuxeLot was built to modernize the online auction experience by combining real-time interactions with a clean and approachable interface. The project focused on making bidding intuitive and engaging, while maintaining clarity and trust throughout the user journey. Key challenges included handling live bid updates, managing user authentication, and ensuring listings and bids felt instantly responsive. Special attention was given to feedback states, so users always understand the current auction status. The design prioritizes focus and hierarchy, reducing distractions while highlighting essential auction information. Every interaction was designed to feel deliberate, responsive, and rewarding for both buyers and sellers."
    },
    {
        "id": 3,
        "name": "DanBook",
        "slug": "danbook",
        "category": "SOCIAL BLOGGING PLATFORM",
        "desc": "DanBook is a social blogging platform where users can create posts, interact with others, and manage their personal profiles in a modern, dark-themed interface.",
        "github": "https://github.com/danielekeberg/holidaze",
        "live": "https://holidaze-iota.vercel.app/",
        "duration": "6 weeks",
        "tech": ["JavaScript", "HTML", "CSS"],
        "img": "../danbook-teaser.png",
        "description": "DanBook was built as a social blogging platform focused on user-generated content and community interaction. The project aimed to create a clean and engaging environment where users can share posts, explore activity feeds, and interact with other users through a familiar social-style interface. Key challenges included implementing full CRUD functionality for posts, handling user authentication, and managing dynamic profile data such as followers, posts, and interactions. Particular attention was given to state management and ensuring updates felt immediate and responsive across the platform. The design emphasizes clarity and immersion through a dark, modern aesthetic with subtle gradients and visual hierarchy. Every interaction was carefully designed to feel smooth, intuitive, and consistent, creating a cohesive social experience from feed to profile."
    }
]